app/controllers/manage/posts_controller.rb

  def upload_image_block
    @post = @current_site.posts.new(:user_id => @current_user, :image => swf_upload_data) # here you can use your favourite plugin to work with attachments
    @post.title = @post.image_file_name
    @post.save
---
INSERT INTO `posts` (`pubdate`, `created_at`, `image_file_name`, `title`, `image_file_size`, `updated_at`, `image_content_type`, `user_id`, `comment_count`, `description`, `image_updated_at`, `site_id`, `likes`) VALUES(NULL, '2010-05-04 16:58:26', 'softwarebanner1.gif', 'softwarebanner1.gif', 19015, '2010-05-04 16:58:26', 'image/gif', 1, NULL, NULL, '2010-05-04 16:58:25', 1, NULL)